# -*- coding: utf-8 -*-

lab = 'Лабораторная по '
pract = 'Практика по '
lenOfSub = 80
time = [8*60 + 0, 9*60 + 50, 11*60 + 40, 13*60 + 45, 15*60 + 35, 17*60 + 25]
timeStr = ['8:00', '9:50', '11:40', '13:45', '15:35', '17:25']
namesOfSub = ['Электрический привод',  # 0 2337
              'Технические средства систем управления',  # 1
              pract + 'ТССУ',  # 2
              pract + 'ЭП',  # 3
              lab + 'ТССУ',  # 4
              'Методы и ТСО безопасности движения транспорта',  # 5
              pract + 'ПрЛогКонстр и ПрС',  # 6
              'ПрЛогКонстр и ПрС',  # 7
              lab + 'ПрЛогКонстр и ПрС',  # 8
              pract + 'Мет. и ТСО БДТ',  # 9
              lab + 'Мет. и ТСО БДТ',  # 10
              'Безопасность жизнедеятельности',  # 11
              pract + 'МПТ в М и Р/Т',  # 12
              'МПТ в М и Р/Т',  # 13
              pract + 'БЖД',  # 14
              lab + 'БЖД',  # 15
              'Курсовая по ТССУ',  # 16
              lab + 'ЭП',  # 17
              lab + 'МПТ в М и Р/Т']
clas = ['2337', '1264', '8000', '1143', '8103', '8203', '1244', '5143', '8207', '5141', '5135', '8000', 'Д102']
subToClas = [0, 1, 2, 3, 4, 5, 4, 6, 5, 4, 4, 7, 8, 6, 9, 10, 11, 12, 8]
subToTeacher = [0, 1, 1, 2, 3, 4, 5, 6, 5, 7, 7, 8, 9, 9, 10, 11, 1, 12, 9]
teacher = ['Башарин',  # 0
           'Кузнецов',  # 1
           'Башарин',  # 2
           'Якутов',  # 3
           'Шелудько',  # 4
           'Вейнмейстер',  # 5
           'Голик',  # 6
           'Казаков',  # 7
           'Буканин',  # 8
           'Путов',  # 9
           'Иванов',  # 10
           'Демидович',  # 11
           'Козлова, Пименова']
queue = [[-1, -1, -1, -1, -1, -1],  # Понедельник 1
         [-1, 0, 1, 2, 4, -1],  # Вторник 1
         [-1, 5, 7, 8, 9, -1],  # Среда 1
         [-1, 11, 13, 14, 16, -1],  # Четверг 1
         [-1, -1, -1, -1, -1, -1],  # Пятница 1
         [17, 17, -1, -1, -1, -1],  # Суббота 1
         [-1, -1, -1, -1, -1, -1],  # Воскресенье 1
         [-1, -1, -1, -1, -1, -1],  # Понедельник 2
         [-1, 0, 1, 3, 4, -1],  # Вторник 2
         [-1, 6, 7, 8, 10, -1],  # Среда 2
         [-1, 12, 18, 15, -1, -1],  # Четверг 2
         [-1, -1, -1, -1, -1, -1],  # Пятница 2
         [17, 17, 1, -1, -1, -1],  # Суббота 2
         [-1, -1, -1, -1, -1, -1]]  # Воскресенье 2
